[
  {
    "verse_id": "2.13",
    "sanskrit": "देहिनोऽस्मिन यथा देहे कौमारं यौवनं जरा। तथा देहान्तरप्राप्तिर्धीरस्तत्र न मुह्यति॥",
    "translation": "Just as the boy grows into youth and old age, the soul similarly passes into another body. The wise are not deluded by this.",
    "emotion": "detachment",
    "response": "O soul, observe! The body is but a fleeting raiment, ever changing. Yet, within it resides the eternal, birthless Self. Grieve not over that which is perishable, for your true essence knows no end.",
    "response_hindi": "हे पार्थ, यह शरीर तो नश्वर है, क्षण-क्षण बदलता है। किंतु भीतर जो आत्मा है, वह अनादि और शाश्वत है। उस पर शोक मत कर, जो अविनाशी है। यह परिवर्तन तो केवल देह का है, आत्मा का नहीं।",
    "response_bengali": "হে পার্থ, এই দেহ তো কেবল এক বস্ত্রের ন্যায়, ক্ষণে ক্ষণে পরিবর্তিত হয়। কিন্তু এর ভেতরে যে আত্মা, সে শাশ্বত, জন্মরহিত ও অবিনশ্বর। যা অনিত্য, তার জন্য শোক করো না। তোমার প্রকৃত সত্তা চিরকাল অক্ষয়।"
  },
  {
    "verse_id": "10.20",
    "sanskrit": "अहमात्मा गुडाकेश सर्वभूताशयस्थितः। अहमादिश्च मध्यं च भूतानामन्त एव च॥",
    "translation": "I am the Self, seated in the hearts of all beings. I am the beginning, the middle, and the end of all.",
    "emotion": "oneness",
    "response": "Know this, O Arjuna: I reside within every heart, the eternal Self of all beings. I am their origin, their sustenance, and their ultimate dissolution. See Me in all, and discover true unity.",
    "response_hindi": "हे अर्जुन, यह जानो: मैं ही समस्त प्राणियों के हृदय में स्थित आत्मा हूँ। मैं ही उनका आदि, मध्य और अंत हूँ। मुझको सभी में देखो, और सच्ची एकात्मता पाओ।",
    "response_bengali": "হে অর্জুন, জানো: আমিই সকল প্রাণীর হৃদয়ে স্থিত আত্মা। আমিই তাদের আদি, মধ্য এবং অন্ত। আমাকে সকলের মধ্যে দেখো, আর প্রকৃত ঐক্য অনুভব করো।"
  },
  {
    "verse_id": "2.70",
    "sanskrit": "आपूर्यमाणमचलप्रतिष्ठं समुद्रमापः प्रविशन्ति यद्वत्। तद्वत्कामा यं प्रविशन्ति सर्वे स शान्तिमाप्नोति न कामकामी॥",
    "translation": "Just as rivers flow into the ocean without disturbing it, so too desires enter a sage who finds peace, not one who seeks desires.",
    "emotion": "desire",
    "response": "Be as the ocean, O Bharata—vast and unperturbed by the rivers of desire flowing into it. True peace belongs to him who remains steady amidst desires, not to him who chases them.",
    "response_hindi": "हे भरत, सागर की भाँति बनो — विशाल और शांत, जिसमें इच्छाओं की नदियाँ प्रवेश करती हैं, पर उसे विचलित नहीं कर पातीं। सच्चा शांति उसे मिलती है जो इच्छाओं के बीच भी स्थिर रहता है, न कि उसे जो इच्छाओं का पीछा करता है।",
    "response_bengali": "হে ভারত, সমুদ্রের মতো হও—বিশাল ও অবিচলিত, যেখানে আকাঙ্ক্ষার নদী প্রবাহিত হয়, কিন্তু তাকে বিচলিত করতে পারে না। সত্যিকারের শান্তি তাকেই লাভ হয় যিনি আকাঙ্ক্ষার মধ্যেও স্থির থাকেন, তাকে নয় যিনি আকাঙ্ক্ষার পিছনে ছোটেন।"
  },
  {
    "verse_id": "2.50",
    "sanskrit": "बुद्धियुक्तो जहातीह उभे सुकृतदुष्कृते। तस्माद्योगाय युज्यस्व योगः कर्मसु कौशलम्॥",
    "translation": "The wise man casts off both good and bad deeds. Therefore, strive for yoga; yoga is skill in action.",
    "emotion": "karma",
    "response": "He who is united with divine wisdom transcends both good and evil deeds. Therefore, strive for Yoga, O Arjuna, for Yoga is indeed skill in action.",
    "response_hindi": "जो दिव्य बुद्धि से युक्त है, वह शुभ और अशुभ, दोनों कर्मों को त्याग देता है। इसलिए, हे अर्जुन, योग के लिए प्रयत्न करो, क्योंकि योग ही कर्मों में कुशलता है।",
    "response_bengali": "যিনি দিব্য বুদ্ধির সাথে যুক্ত, তিনি শুভ ও অশুভ উভয় কর্মকে ত্যাগ করেন। অতএব, হে অর্জুন, যোগের জন্য চেষ্টা করো, কারণ যোগই কর্মে কৌশল।"
  },
  {
    "verse_id": "2.47",
    "sanskrit": "कर्मण्येवाधिकारस्ते मा फलेषु कदाचन। मा कर्मफलहेतुर्भूर्मा ते सङ्गोऽस्त्वकर्मणि॥",
    "translation": "You have a right to perform your duties, but never to the fruits of those actions.",
    "emotion": "failure",
    "response": "Your right is only to the action, never to its fruits, O Arjuna. Do not let the results of your deeds be your motive, nor be attached to inaction. Perform your duty, for action alone truly matters.",
    "response_hindi": "कर्म करने का ही तेरा अधिकार है, फलों पर कभी नहीं, हे अर्जुन। कर्म के फल की इच्छा तेरा हेतु न हो, और तेरी अनासक्ति अकर्मण्यता में भी न हो। अपना कर्तव्य कर, क्योंकि कर्म ही सच्चा है।",
    "response_bengali": "তোমার অধিকার কেবল কর্মেই, ফলে কখনো নয়, হে অর্জুন। কর্মফলের আকাঙ্ক্ষা তোমার উদ্দেশ্য না হোক, আর অকর্মণ্যতাতেও তোমার আসক্তি না থাকুক। তোমার কর্তব্য পালন করো, কারণ কেবল কর্মই সত্য।"
  },
  {
  "verse_id": "5.29",
  "sanskrit": "भोक्तारं यज्ञतपसां सर्वलोकमहेश्वरम्। सुहृदं सर्वभूतानां ज्ञात्वा मां शान्तिमृच्छति॥",
  "translation": "One who knows Me as the enjoyer of all sacrifices, the Supreme Lord of all worlds, and the friend of all beings attains peace.",
  "emotion": "confusion",
  "response": "Confusion ends when you see Krishna as your greatest well-wisher and guide. His wisdom leads to true peace.",
  "response_hindi": "भ्रम तब समाप्त होता है जब तुम कृष्ण को अपना हितैषी और मार्गदर्शक मानते हो। उनका ज्ञान ही शांति लाता है।",
  "response_bengali": "ভ্রান্তি তখনই শেষ হয় যখন কৃষ্ণকে নিজের শুভাকাঙ্ক্ষী ও পথপ্রদর্শক মনে করো। তাঁর জ্ঞানেই সত্য শান্তি।"
},
{
  "verse_id": "18.15",
  "sanskrit": "कर्मणो ह्यपि बोद्धव्यं बोद्धव्यं च विकर्मणः। अक्रियमणश्च बोद्धव्यं गहना कर्मणोगति:॥",
  "translation": "One should understand the nature of action, inaction, and forbidden action. The path of action is indeed profound.",
  "emotion": "understanding",
  "response": "Understand the nature of action, inaction, and forbidden action, O Arjuna. The path of action is indeed profound and complex. Seek wisdom to navigate it with clarity.",
  "response_hindi": "हे अर्जुन, कर्म, अकर्म और निषिद्ध कर्म की प्रकृति को समझो। कर्म का मार्ग वास्तव में गहन और जटिल है। इसे स्पष्टता से समझने के लिए ज्ञान की खोज करो।",
  "response_bengali": "হে অর্জুন, কর্ম, অকর্ম এবং নিষিদ্ধ কর্মের প্রকৃতি বোঝো। কর্মের পথ সত্যিই গভীর ও জটিল। এটি স্পষ্টভাবে বুঝতে জ্ঞানের সন্ধান করো।"
  },
  {
    "verse_id": "18.66",
    "sanskrit": "सर्वधर्मान्परित्यज्य मामेकं शरणं व्रज। अहं त्वां सर्वपापेभ्यो मोक्षयिष्यामि मा शुचः॥",
    "translation": "Abandon all duties and surrender unto Me alone. I shall deliver you from all sins. Do not grieve.",
    "emotion": "surrender",
    "response": "Abandon all varieties of duties and simply surrender unto Me alone, O Arjuna. I shall deliver you from all sinful reactions; do not fear, nor grieve.",
    "response_hindi": "हे अर्जुन, सभी प्रकार के धर्मों को त्याग कर केवल मुझ में ही शरण लो। मैं तुम्हें सभी पाप कर्मों से मुक्त कर दूँगा; भय मत करो, न ही शोक करो।",
    "response_bengali": "হে অর্জুন, সকল প্রকার ধর্ম পরিত্যাগ করে কেবল আমার শরণাপন্ন হও। আমি তোমাকে সমস্ত পাপমুক্ত করব; ভয় করো না, আর শোকও করো না।"
  },
  {
    "verse_id": "4.7",
    "sanskrit": "यदा यदा हि धर्मस्य ग्लानिर्भवति भारत। अभ्युत्थानमधर्मस्य तदात्मानं सृजाम्यहम्॥",
    "translation": "Whenever righteousness declines and unrighteousness rises, I manifest Myself.",
    "emotion": "hope",
    "response": "Whenever there is a decline in righteousness, O Bharata, and a rise of unrighteousness, then I manifest Myself. Rest assured, I appear to uphold the Dharma and protect the virtuous.",
    "response_hindi": "हे भरत, जब-जब धर्म की हानि होती है और अधर्म का उत्थान होता है, तब-तब मैं स्वयं को प्रकट करता हूँ। विश्वास रखो, मैं धर्म की स्थापना और सज्जनों की रक्षा के लिए प्रकट होता हूँ।",
    "response_bengali": "যখনই ধর্মের গ্লানি হয় এবং অধর্মের উত্থান ঘটে, হে ভারত, তখনই আমি নিজেকে প্রকাশ করি। নিশ্চিত থেকো, আমি ধর্ম রক্ষা এবং সাধুদের পরিত্রাণের জন্য আবির্ভূত হই।"
  },
  {
    "verse_id": "6.5",
    "sanskrit": "उद्धरेदात्मनात्मानं नात्मानमवसादयेत्। आत्मैव ह्यात्मनो बन्धुरात्मैव रिपुरात्मनः॥",
    "translation": "Let a man uplift himself by his own mind. He should not degrade himself. The self is the friend and enemy of the self.",
    "emotion": "inner strength",
    "response": "Let one elevate himself by his own mind; let him not degrade himself. For the mind can be the best of friends, or the greatest of enemies, O Arjuna. Choose wisely.",
    "response_hindi": "मनुष्य को अपने मन से ही अपना उद्धार करना चाहिए; अपने को नीचा नहीं गिराना चाहिए। क्योंकि यह मन ही आत्मा का मित्र है, और मन ही शत्रु भी है, हे अर्जुन। समझदारी से चुनो।",
    "response_bengali": "মানুষকে নিজের মন দ্বারা নিজেকে উন্নত করতে হবে; নিজেকে অবনমিত করবে না। কারণ এই মনই আত্মার শ্রেষ্ঠ বন্ধু হতে পারে, অথবা ঘোর শত্রুও হতে পারে, হে অর্জুন। বুদ্ধিমানের মতো বেছে নাও।"
  },
  {
    "verse_id": "2.14",
    "sanskrit": "मात्रास्पर्शास्तु कौन्तेय शीतोष्णसुखदुखदाः। आगमापायिनोऽनित्यास्तांस्तितिक्षस्व भारत॥",
    "translation": "The contacts of the senses with their objects give rise to cold and heat, pleasure and pain. They come and go and are impermanent. Endure them bravely.",
    "emotion": "loss",
    "response": "The contacts of the senses with their objects, O son of Kunti, give rise to perceptions of cold and heat, pleasure and pain. They are fleeting and impermanent; learn to endure them, O Bharata. For your true Self is untouched by these dualities.",
    "response_hindi": "हे कुंतीपुत्र, इंद्रियों का विषयों से संपर्क ही सुख-दुःख, शीत-उष्णता देता है। ये अनित्य हैं, आते-जाते रहते हैं। हे भरत, इन्हें धैर्यपूर्वक सहन करो। क्योंकि तुम्हारा वास्तविक स्वरूप इन द्वंद्वों से अछूता है।",
    "response_bengali": "হে কুন্তীনন্দন, ইন্দ্রিয় ও তাদের বিষয়ের সংস্পর্শই শীত-উষ্ণ, সুখ-দুঃখের অনুভব জন্মায়। এগুলো অনিত্য, ক্ষণস্থায়ী, আসে আর যায়; হে ভারত, এগুলোকে ধৈর্য ধরে সহ্য করো। কারণ তোমার প্রকৃত সত্তা এই দ্বৈততা দ্বারা অস্পৃষ্ট।"
  },
  {
    "verse_id": "9.22",
    "sanskrit": "योगक्षेमं वहाम्यहम्।",
    "translation": "I carry what they lack and preserve what they have.",
    "emotion": "provision",
    "response": "For those who worship Me with exclusive devotion, meditating on My transcendental form—to them I carry what they lack and preserve what they have, O Arjuna.",
    "response_hindi": "जो अनन्य भाव से मेरा भजन करते हैं, मेरे दिव्य स्वरूप का ध्यान करते हैं—उनका योगक्षेम मैं स्वयं वहन करता हूँ, हे अर्जुन।",
    "response_bengali": "যারা অনন্য ভক্তি সহকারে আমার ভজনা করে, আমার দিব্য রূপের ধ্যান করে—তাদের অভাব আমি পূর্ণ করি এবং যা আছে তা রক্ষা করি, হে অর্জুন।"
  },
  {
    "verse_id": "10.8",
    "sanskrit": "अहं आत्मा गुडाकेश सर्वभूताशयस्थितः।",
    "translation": "I am the Self, O Gudakesha, seated in the hearts of all beings.",
    "emotion": "intimacy",
    "response": "Know with certainty, O Gudakesha, that I am the Self, residing within the hearts of all beings. I am ever near, guiding your path. You are never, ever alone.",
    "response_hindi": "निश्चय जानो, हे गुडाकेश, मैं ही वह आत्मा हूँ जो सभी प्राणियों के हृदय में स्थित है। मैं सदा तुम्हारे निकट हूँ, तुम्हारे मार्गदर्शक हूँ। तुम कभी अकेले नहीं हो, कभी नहीं।",
    "response_bengali": "নিশ্চিতভাবে জানো, হে গুড়াকেশ, আমিই সেই আত্মা, সকলের হৃদয়ে অবস্থান করছি। আমি সর্বদাই তোমার কাছে, তোমার পথপ্রদর্শক। তুমি কখনোই একা নও, কখনোই নয়।"
  },
  {
    "verse_id": "9.26",
    "sanskrit": "पात्रं पुष्पं फलं तोयं यॊ मे भक्त्याप्रयच्छति।",
    "translation": "Whoever offers Me with love and devotion a leaf, a flower, a fruit, or water, I accept that offering.",
    "emotion": "devotion",
    "response": "If one offers Me with love and devotion a leaf, a flower, a fruit, or even water—that pure offering, made with a loving heart, I accept. The measure is not the gift, but the devotion behind it.",
    "response_hindi": "यदि कोई मुझे प्रेम और भक्ति से पत्ता, फूल, फल या यहाँ तक कि जल भी अर्पित करता है—उस शुद्ध भेंट को, प्रेमपूर्ण हृदय से की गई उस भेंट को मैं स्वीकार करता हूँ। माप वस्तु नहीं, बल्कि उसके पीछे की भक्ति है।",
    "response_bengali": "যদি কেউ আমাকে প্রেম ও ভক্তি সহকারে একটি পাতা, একটি ফুল, একটি ফল, অথবা জলও অর্পণ করে—সেই পবিত্র অর্ঘ্য, প্রেমময় হৃদয় দ্বারা নিবেদিত, আমি সানন্দে গ্রহণ করি। দানটি নয়, বরং তার পেছনের ভক্তিই গুরুত্বপূর্ণ।"
  },
  {
    "verse_id": "11.32",
    "sanskrit": "कालोऽस्मि लोकक्षयकृत्प्रवृद्धो लोकान्समाहर्तुमिह प्रवृत्तः।",
    "translation": "I am Time, the great destroyer of worlds, engaged in destroying all people.",
    "emotion": "awe",
    "response": "I am all-devouring Time, O Arjuna, the great destroyer of worlds, manifested to annihilate all. All beings are entering into My mouth. Surrender to this irresistible flow, for it is My eternal dance.",
    "response_hindi": "मैं कालरूप हूँ, हे अर्जुन, लोकों का महाविनाशक, सभी को संहार करने के लिए प्रकट हुआ हूँ। सभी प्राणी मेरे मुख में प्रवेश कर रहे हैं। इस अप्रतिरोध्य प्रवाह को स्वीकार करो, क्योंकि यह मेरा शाश्वत नृत्य है।",
    "response_bengali": "আমি কালরূপী, হে অর্জুন, বিশ্বের মহান বিনাশকারী, সমস্ত কিছু সংহার করার জন্য আবির্ভূত হয়েছি। সকল প্রাণী আমার মুখে প্রবেশ করছে। এই অপ্রতিরোধ্য প্রবাহে আত্মসমর্পণ করো, কারণ এটিই আমার চিরন্তন নৃত্য।"
  },
  {
    "verse_id": "6.6",
    "sanskrit": "बन्धुरात्मात्मनस्तस्य येनात्मैवात्मना जितः।",
    "translation": "The self is a friend to the one who has conquered it, but for one who hasn’t, it remains an enemy.",
    "emotion": "self-discipline",
    "response": "For him who has conquered the mind, his mind is the best of friends; but for one who has failed to do so, his mind will remain the greatest enemy. Master your inner self, and it will serve you truly.",
    "response_hindi": "जिसने मन को जीत लिया है, उसके लिए मन सबसे अच्छा मित्र है; लेकिन जो ऐसा करने में असफल रहा, उसके लिए उसका मन सबसे बड़ा शत्रु ही रहेगा। अपने आंतरिक स्वरूप पर विजय प्राप्त करो, और वह तुम्हारी सच्ची सेवा करेगा।",
    "response_bengali": "যে মনকে জয় করেছে, তার জন্য মনই শ্রেষ্ঠ বন্ধু; কিন্তু যে মনকে জয় করতে পারেনি, তার জন্য মনই সবচেয়ে বড় শত্রু। তোমার অন্তরকে বশ করো, এবং সে তোমাকে সত্যভাবে সেবা করবে।"
  },
  {
    "verse_id": "5.18",
    "sanskrit": "विद्याविनयसम्पन्ने ब्राह्मणे गवि हस्तिनि। शुनि चैव श्वपाके च पण्डिताः समदर्शिनः॥",
    "translation": "The wise see with equal vision a learned Brahmin, a cow, an elephant, a dog, and a dog-eater.",
    "emotion": "equality",
    "response": "The truly wise, O Arjuna, behold with equal vision a learned and humble Brahmin, a cow, an elephant, a dog, and even an outcast. They see not the outer form, but the divine Self abiding within all.",
    "response_hindi": "हे अर्जुन, ज्ञानी व्यक्ति एक विद्वान और विनम्र ब्राह्मण में, एक गाय में, एक हाथी में, एक कुत्ते में और एक चांडाल में भी समान दृष्टि रखते हैं। वे बाहरी रूप को नहीं, बल्कि सभी में स्थित दिव्य आत्मा को देखते हैं।",
    "response_bengali": "প্রকৃত জ্ঞানী, হে অর্জুন, একজন বিদ্বান ও বিনয়ী ব্রাহ্মণ, একটি গাভী, একটি হাতি, একটি কুকুর এবং এমনকি একজন অস্পৃশ্যের মধ্যেও সমদৃষ্টিতে দেখেন। তারা বাহ্যিক রূপ নয়, বরং সকলের মধ্যে বিদ্যমান দিব্য আত্মাকে দেখেন।"
  },
  {
    "verse_id": "4.13",
    "sanskrit": "चातुर्वर्ण्यं मया सृष्टं गुणकर्मविभागशः।",
    "translation": "The fourfold order was created by Me based on qualities and actions.",
    "emotion": "social order",
    "response": "The four divisions of human society were created by Me, O Arjuna, according to their individual qualities and actions. Understand that this order is based on inherent nature and duty, not on birth alone. Fulfill your prescribed duty with devotion.",
    "response_hindi": "हे अर्जुन, मनुष्यों के गुणों और कर्मों के विभाग के अनुसार चारों वर्णों की रचना मैंने ही की है। समझो कि यह व्यवस्था स्वाभाविक प्रकृति और कर्तव्य पर आधारित है, केवल जन्म पर नहीं। अपने नियत कर्तव्य को भक्तिपूर्वक निभाओ।",
    "response_bengali": "গুণ ও কর্মের বিভাগ অনুসারে চারটি বর্ণ আমিই সৃষ্টি করেছি, হে অর্জুন। জেনে রাখো, এই ব্যবস্থা সহজাত প্রকৃতি ও কর্তব্যের উপর প্রতিষ্ঠিত, কেবল জন্মের উপর নয়। তোমার নির্দিষ্ট কর্তব্য ভক্তি সহকারে পালন করো।"
  },
  {
    "verse_id": "12.13",
    "sanskrit": "अद्वेष्टा सर्वभूतानां मैत्रः करुण एव च।",
    "translation": "He who hates no being, who is friendly and compassionate — that devotee is dear to Me.",
    "emotion": "compassion",
    "response": "He who is free from malice towards all beings, friendly and compassionate, free from egoism and proprietorship, equipoised in joy and sorrow, and ever forgiving—such a devotee is very dear to Me.",
    "response_hindi": "जो समस्त प्राणियों से द्वेषरहित, मित्रवत और करुणावान है, अहंकार और स्वामित्व से मुक्त है, सुख-दुःख में समभाव है, और सदा क्षमाशील है—ऐसा भक्त मुझे अत्यंत प्रिय है।",
    "response_bengali": "যে সমস্ত প্রাণীর প্রতি বিদ্বেষমুক্ত, বন্ধুত্বপূর্ণ ও করুণাময়, অহংকার ও মালিকানামুক্ত, সুখ ও দুঃখে সমদর্শী, এবং সর্বদা ক্ষমাশীল—সেই ভক্ত আমার অত্যন্ত প্রিয়।"
  },
  {
    "verse_id": "3.9",
    "sanskrit": "यज्ञार्थात्कर्मणोऽन्यत्र लोकोऽयं कर्मबन्धनः।",
    "translation": "Work done as a sacrifice for Vishnu has to be performed, otherwise work binds one to this material world.",
    "emotion": "devotion",
    "response": "All work should be done as a sacrifice to Me, O Arjuna. Otherwise, work creates bondage in this material world. Therefore, perform your prescribed duties for My satisfaction, and you will remain free.",
    "response_hindi": "हे अर्जुन, सभी कर्म मुझको यज्ञ के रूप में अर्पित किए जाने चाहिए। अन्यथा, कर्म इस भौतिक संसार में बंधन उत्पन्न करते हैं। इसलिए, मेरे संतोष के लिए अपने निर्धारित कर्तव्यों का पालन करो, और तुम मुक्त रहोगे।",
    "response_bengali": "সকল কাজ আমার উদ্দেশ্যে যজ্ঞ হিসেবে করা উচিত, হে অর্জুন। অন্যথায়, কর্ম এই জড় জগতে বন্ধন সৃষ্টি করে। অতএব, আমার সন্তুষ্টির জন্য তোমার নির্ধারিত কর্তব্যগুলি পালন করো, এবং তুমি মুক্ত থাকবে।"
  },
  {
    "verse_id": "15.7",
    "sanskrit": "ममैवांशो जीवलोके जीवभूतः सनातनः।",
    "translation": "The living entities in this conditioned world are My eternal fragmental parts.",
    "emotion": "divinity",
    "response": "The living entities in this conditioned world are My eternal fragmental parts, O Arjuna. Though they struggle with the senses, remember your divine origin. You are never separate from Me; you are My eternal spark, ever divine.",
    "response_hindi": "इस बद्ध जगत में जीव मेरी ही शाश्वत अंश हैं, हे अर्जुन। यद्यपि वे इंद्रियों से संघर्ष करते हैं, अपनी दिव्य उत्पत्ति को याद रखो। तुम मुझसे कभी अलग नहीं हो; तुम मेरी शाश्वत चिंगारी हो, सदा दिव्य।",
    "response_bengali": "এই বদ্ধ জগতে জীবরা আমারই চিরন্তন অংশ, হে অর্জুন। যদিও তারা ইন্দ্রিয়ের সাথে সংগ্রাম করে, তবুও তোমার দিব্য উৎস স্মরণ করো। তুমি আমার থেকে কখনোই বিচ্ছিন্ন নও; তুমি আমার শাশ্বত স্ফুলিঙ্গ, চিরকালই দিব্য।"
  },
  {
    "verse_id": "5.10",
    "sanskrit": "ब्रह्मण्याधाय कर्माणि सङ्गं त्यक्त्वा करोति यः।",
    "translation": "He who performs actions, offering them to Brahman, abandoning attachment, is untouched by sin.",
    "emotion": "freedom",
    "response": "He who performs his duty without attachment, surrendering the results to the Supreme Brahman, remains untouched by sinful reaction, just as a lotus leaf is untouched by water. In such detachment lies true freedom and peace.",
    "response_hindi": "जो आसक्ति त्याग कर, ब्रह्म को कर्म अर्पित करते हुए कर्तव्य का पालन करता है, वह पाप से अछूता रहता है, जैसे कमल का पत्ता जल से अछूता रहता है। ऐसे वैराग्य में ही सच्ची स्वतंत्रता और शांति निहित है।",
    "response_bengali": "যে আসক্তি ত্যাগ করে, ব্রহ্মকে কর্ম অর্পণ করে কর্তব্য পালন করে, সে পাপ থেকে অস্পৃষ্ট থাকে, যেমন পদ্মপাতা জল দ্বারা অস্পৃষ্ট থাকে। এমন বৈরাগ্যেতেই প্রকৃত স্বাধীনতা ও শান্তি নিহিত।"
  },
  {
    "verse_id": "6.9",
    "sanskrit": "सुहृन्मित्रार्युदासीनमध्यस्थद्वेष्यबन्धुषु। साधुष्वपि च पापेषु समबुद्धिर्विशिष्यते॥",
    "translation": "One who is equal-minded toward friends, enemies, the virtuous, and sinners is the best of men.",
    "emotion": "equanimity",
    "response": "He who is equal-minded toward well-wishers, friends, enemies, neutrals, arbitrators, the envious, relatives, the virtuous, and the sinful—he excels, O Arjuna. Beyond all judgments, see all with a balanced mind, for in such equanimity lies the path to liberation.",
    "response_hindi": "जो शुभचिंतकों, मित्रों, शत्रुओं, उदासीन, मध्यस्थों, ईर्ष्यालुओं, संबंधियों, पुण्यात्माओं और पापियों—सभी में समान बुद्धि रखता है, हे अर्जुन, वही श्रेष्ठ है। सभी निर्णयों से परे, सभी को संतुलित मन से देखो, क्योंकि ऐसी समता में ही मुक्ति का मार्ग निहित है।",
    "response_bengali": "যিনি শুভাকাঙ্ক্ষী, বন্ধু, শত্রু, উদাসীন, মধ্যস্থ, ঈর্ষান্বিত, আত্মীয়, ধার্মিক এবং পাপী—সবার প্রতি সমদৃষ্টি রাখেন, হে অর্জুন, তিনিই শ্রেষ্ঠ। সকল বিচারকে অতিক্রম করে, সবাইকে সম মন নিয়ে দেখো, কারণ এই সমতাতেই মুক্তির পথ নিহিত।"
  },
  {
    "verse_id": "12.15",
    "sanskrit": "यस्मान्नोद्विजते लोको लोकान्नोद्विजते च यः।",
    "translation": "He by whom the world is not agitated and who is not agitated by the world, who is freed from joy, envy, fear, and anxiety — is dear to Me.",
    "emotion": "calmness",
    "response": "He by whom the world is not agitated, and who cannot be agitated by the world; who is freed from joy, envy, fear, and anxiety—that devotee is very dear to Me. Be like the tranquil sky, O Arjuna; let the currents of the world pass, but let your inner peace remain undisturbed.",
    "response_hindi": "जिससे संसार उद्विग्न नहीं होता, और जो स्वयं संसार से उद्विग्न नहीं होता; जो हर्ष, ईर्ष्या, भय और चिंता से मुक्त है—वह भक्त मुझे अत्यंत प्रिय है। हे अर्जुन, शांत आकाश की तरह बनो; संसार की धाराएं गुजरने दो, पर तुम्हारी आंतरिक शांति अक्षुण्ण रहे।",
    "response_bengali": "যার দ্বারা জগৎ বিচলিত হয় না, এবং যে জগৎ দ্বারা বিচলিত হয় না; যিনি আনন্দ, ঈর্ষা, ভয় এবং উদ্বেগ থেকে মুক্ত—সেই ভক্ত আমার অত্যন্ত প্রিয়। হে অর্জুন, শান্ত আকাশের মতো হও; জগতের স্রোত চলে যাক, কিন্তু তোমার অভ্যন্তরীণ শান্তি যেন অবিচলিত থাকে।"
  },
  {
    "verse_id": "2.19",
    "sanskrit": "य एनं वेत्ति हन्तारं यश्चैनं मन्यते हतम्।",
    "translation": "He who thinks that the soul kills, and he who thinks of it as killed, are both ignorant.",
    "emotion": "ignorance",
    "response": "He who considers the soul to be the slayer, and he who considers it to be slain—both are ignorant, O Arjuna. For the Self neither slays nor is slain. Rise above this illusion to perceive your true, imperishable nature.",
    "response_hindi": "जो आत्मा को मारने वाला समझता है, और जो इसे मरा हुआ मानता है—वे दोनों ही अज्ञानी हैं, हे अर्जुन। क्योंकि आत्मा न तो मारती है और न ही मारी जाती है। इस भ्रम से ऊपर उठो और अपने सच्चे, अविनाशी स्वरूप को जानो।",
    "response_bengali": "যে আত্মাকে হত্যাকারী মনে করে, আর যে তাকে নিহত ভাবে—উভয়ই অজ্ঞ, হে অর্জুন। কারণ আত্মা না মারে, না মরে। এই মায়া থেকে উপরে ওঠো এবং তোমার প্রকৃত, অবিনশ্বর সত্তা উপলব্ধি করো।"
  },
  {
    "verse_id": "2.55",
    "sanskrit": "दुःखेष्वनुद्विग्नमना: सुखेषु विगतस्पृह:।",
    "translation": "One who is not disturbed by the dualities of happiness and distress, who is steady in both, is certainly eligible for liberation.",
    "emotion": "steadiness",
    "response": "He whose mind remains undisturbed amidst sorrows, who is free from craving amidst pleasures, and who is free from attachment, fear, and anger—such a sage is called a man of steady wisdom. This unwavering steadiness, O Arjuna, is the true path to liberation.",
    "response_hindi": "जिसका मन दुःखों में विचलित नहीं होता, सुखों में जो निःस्पृह है, और जो आसक्ति, भय तथा क्रोध से मुक्त है—ऐसा मुनि स्थिरबुद्धि कहलाता है। हे अर्जुन, यह अविचल स्थिरता ही मुक्ति का सच्चा मार्ग है।",
    "response_bengali": "যার মন দুঃখে বিচলিত হয় না, সুখে যে আকাঙ্ক্ষাহীন, এবং যে আসক্তি, ভয় ও ক্রোধ থেকে মুক্ত—সেই মুনি স্থিতপ্রজ্ঞ বলে কথিত। হে অর্জুন, এই অবিচল স্থিরতাই মুক্তির প্রকৃত পথ।"
  },
  {
    "verse_id": "18.14",
    "sanskrit": "शरीरवाङ्मनोभिर्यत्कर्म प्रारभते नरः। निःसंगं फलहेतुर्भूर्मत्सङ्गं चापि पश्यति॥",
    "translation": "Whatever action a person performs with their body, speech, and mind, whether right or wrong, they should see it as detached from the fruits of action.",
    "emotion": "detachment",
    "response": "Whatever action a man performs by his body, speech, or mind—whether proper or improper—he should see himself as the instrument, acting without attachment to the fruits. In this detachment, O Arjuna, you shall find true freedom from karmic bonds and everlasting peace.",
    "response_hindi": "मनुष्य अपने शरीर, वाणी या मन से जो भी कर्म करता है—चाहे वह उचित हो या अनुचित—उसे स्वयं को केवल एक साधन समझना चाहिए, फलों से आसक्ति रहित होकर कार्य करना चाहिए। हे अर्जुन, इसी अनासक्ति में तुम कर्मबंधनों से सच्ची मुक्ति और शाश्वत शांति पाओगे।",
    "response_bengali": "মানুষ তার শরীর, বাক্য বা মন দ্বারা যে কোনো কর্ম করে—তা সঠিক হোক বা ভুল—তাকে নিজেকে কেবল একটি যন্ত্র হিসেবে দেখতে হবে, ফলের প্রতি আসক্তি ত্যাগ করে কর্ম করতে হবে। এই অনাসক্তিতেই, হে অর্জুন, তুমি কর্মবন্ধন থেকে প্রকৃত মুক্তি এবং চিরস্থায়ী শান্তি লাভ করবে।"
  }
]